#include "delay.h" 
#include "sensorpulse.h" 
/****************************************************************************
* ??3?¡êovoid  InitWatchDog(void)
* 1|?¨¹¡êo3?¨º??¡¥?¡ä??1¡¤
* ¨¨??¨²2?¨ºy¡êo?T
* 3??¨²2?¨ºy¡êo?T
****************************************************************************/
void  InitWatchDog(void)
{
//	WDT_Init(WDT_CLKSRC_IRC,WDT_MODE_RESET);
//	WDT_Start(2000000);
//	FeedDog();
//	GPIO_PinselConfig(WATCHDOG,0);	
//
//	FeedDog();

}

/****************************************************************************
* ??3?¡êovoid  FeedDog(void)
* 1|?¨¹¡êo?¡ä??1¡¤?11¡¤2¨´¡Á¡Â?¡ê
* ¨¨??¨²2?¨ºy¡êo?T
* 3??¨²2?¨ºy¡êo?T
****************************************************************************/
void  FeedDog(void)
{  
//	WDT_Feed();
//   if(GPIO_ReadIoVal(WATCHDOG))
//   {
//   		GPIO_SetOrClearValue(WATCHDOG,0);
//   }
//   else
//   {
//   		GPIO_SetOrClearValue(WATCHDOG,1);	
//   }
}


/****************************************************************************
* ??3?¡êovoid  FeedDog(void)
* 1|?¨¹¡êo?¡ä??1¡¤?11¡¤2¨´¡Á¡Â?¡ê
* ¨¨??¨²2?¨ºy¡êo?T
* 3??¨²2?¨ºy¡êo?T
****************************************************************************/
void  ResetSys(void)
{  
	while(1);	
}